taylortrimble/pic18usb/USBFramework.c
            // Also reset the OUT Buffer; no OUT tokens required for EP0
            _USBBD0O.status = (UOWN|DTSEN); // SIE owns BD, data toggle enabled
            _USBBD0O.count = EP0_SIZE;      // Allow to receive full packet
            break;
        default:
            _USBHandleControlError();
            break;
    }
}

void _USBEngineReset(void)
{
#warning _uSBEngineReset may require a redo
    unsigned char *index;

    // Clear USTAT FIFO
    UIRbits.TRNIF = 0;
    UIRbits.TRNIF = 0;
    UIRbits.TRNIF = 0;
    UIRbits.TRNIF = 0;

    // Disable all endpoints
    for (index = (unsigned char *)&UEP0;
         index <= (unsigned char *)&UEP7;
         index++) {
        *index = 0x00;
    }

    // Reset endpoint buffer descriptors
    _USBConfigureBufferDescriptors();

    // Reset general USB
    _USBDeviceState = USBDeviceStateReset;
    _USBEngineStatus = USBEngineStatusReset;
    _USBDeviceStatus = 0x01;
    _USBCurrentConfiguration = 0;

    UEIE = 0x00;    // Disable and clear all USB interrupts
    UEIR = 0x00;
    UIE = 0x00;
    UIR = 0x00;
    UADDR = 0x00;   // Reset USB address

    // Enable EP0
    UEP0 = 0x16;    // SETUP endpoint, not stalled

    // Re-enable USB interrupts
    UIEbits.ACTVIE = 1;
    UIEbits.IDLEIE = 1;
    UIEbits.TRNIE = 1;  // Enable transaction complete interrupts
    PIE2bits.USBIE = 1; // Enable USB interrupts

    // Re-enable USB error interrupts
    UEIEbits.BTOEE = 1;
    UEIEbits.BTSEE = 1;
    UEIEbits.CRC16EE = 1;
    UEIEbits.CRC5EE = 1;
    UEIEbits.DFN8EE = 1;
    UEIEbits.PIDEE = 1;
    UIEbits.UERRIE = 1; // Enable USB error interrupts
}

void _USBConfigureBufferDescriptors(void)
{
    _USBResetEP0InBuffer();
    _USBBD0O.status = (UOWN|DTSEN); // SIE owns BD, data toggle enabled
    _USBBD0O.count = EP0_SIZE;      // Allow to receive full packet
}

void _USBSetup()
{
    // Setup
    LATC = 0x00;
    TRISC = 0xF0;

    // status = 0x01; for all disabled?????
    // Set device variables
    _USBDeviceState = USBDeviceStateReset;         // Reset USB state
    _USBEngineStatus = USBEngineStatusReset;
    _USBDeviceStatus = 0x01;
    _USBCurrentConfiguration = 0;

    // General USB setup
    UEIE = 0x00;    // Disable and clear all USB interrupts
    UEIR = 0x00;
    UIE = 0x00;
    UIR = 0x00;
    UCON = 0x00;    // Resume signaling off, suspend mode off, USB off
    UCFG = 0x16;    // Eye off, pull ups enabled, full speed, ping pong all
    UADDR = 0x00;   // Reset USB address

    // Configure endpoint buffer descriptors
    _USBConfigureBufferDescriptors();

    // Configure endpoints
    UEP0 = 0x14;    // SETUP endpoint, not stalled

    // Enable USB
    Delay1KTCYx(24);        // Wait 2ms for clock to stabilize
    UCONbits.USBEN = 1;     // then enable USB
    while (UCONbits.SE0);   // Wait for first SE0 to end (marks bus power)

    // Configure USB interrupts
    UIEbits.ACTVIE = 1;
    UIEbits.IDLEIE = 1;
    UIEbits.TRNIE = 1;  // Enable transaction complete interrupts
    PIE2bits.USBIE = 1; // Enable USB interrupts

    // Configure USB error interrupts
    UEIEbits.BTOEE = 1;
    UEIEbits.BTSEE = 1;
    UEIEbits.CRC16EE = 1;
    UEIEbits.CRC5EE = 1;
    UEIEbits.DFN8EE = 1;
    UEIEbits.PIDEE = 1;
    UIEbits.UERRIE = 1; // Enable USB error interrupts

    // Enable global interrupts
    INTCONbits.PEIE = 1;
    INTCONbits.GIE = 1;

    _USBDeviceState |= USBDeviceStateInitialized;  // Set USB state to initialized
}

void InitUSB(void) {
    UIE = 0x00;                 // mask all USB interrupts
    UIR = 0x00;                 // clear all USB interrupt flags
    UCFG = 0x14;                // configure USB for low-speed transfers and to use the on-chip transciever and pull-up resistor
    UCON = 0x08;                // enable the USB module and its supporting circuitry
    _USBCurrentConfiguration = 0x00;
    _USBDeviceState = USBDeviceStateReset;         // default to powered state
    _USBDeviceStatus = 0x01;
    _USBEngineStatus = USBEngineStatusReset;   // No device requests in process
#ifdef SHOW_ENUM_STATUS
    TRISC = 0x00;               // set all bits of LATC as outputs
    LATC = 0x01;                // set bit zero to indicate Powered status
#endif
    while (UCONbits.SE0);       // wait for the first SE0 to end
}

void ServiceUSB(void) {
    USBBufferDescriptor *currentBufferDescriptor;

    if (UIRbits.UERRIF) {
        UEIR = 0x00;
    } else if (UIRbits.SOFIF) {
        UIRbits.SOFIF = 0;
    } else if (UIRbits.IDLEIF) {
        UIRbits.IDLEIF = 0;
        UCONbits.SUSPND = 1;
#ifdef SHOW_ENUM_STATUS
        LATC &= 0xE0;
        LATCbits.LATC4 = 1;
#endif
    } else if (UIRbits.ACTVIF) {
        UIRbits.ACTVIF = 0;
        UCONbits.SUSPND = 0;
#ifdef SHOW_ENUM_STATUS
        LATC &= 0xE0;
        LATC |= 0x01<<_USBDeviceState;
#endif
    } else if (UIRbits.STALLIF) {
        UIRbits.STALLIF = 0;
    } else if (UIRbits.URSTIF) {
        _USBCurrentConfiguration = 0x00;
        UIRbits.TRNIF = 0;      // clear TRNIF four times to clear out the USTAT FIFO
        UIRbits.TRNIF = 0;
        UIRbits.TRNIF = 0;
        UIRbits.TRNIF = 0;
        UEP0 = 0x00;                // clear all EP control registers to disable all endpoints
        UEP1 = 0x00;
        UEP2 = 0x00;
        UEP3 = 0x00;
        UEP4 = 0x00;
        UEP5 = 0x00;
        UEP6 = 0x00;
        UEP7 = 0x00;
        _USBBD0O.count = MAX_PACKET_SIZE;
        _USBBD0O.address = _USBEP0OutBuffer;  // EP0 OUT gets a buffer
        _USBBD0O.status = 0x88;             // set UOWN bit (USB can write)
        _USBBD0I.address = _USBEP0InBuffer;   // EP0 IN gets a buffer
        _USBBD0I.status = 0x08;             // clear UOWN bit (MCU can write)
        UADDR = 0x00;               // set USB Address to 0
        UIR = 0x00;             // clear all the USB interrupt flags
        UEP0 = ENDPT_CONTROL;   // EP0 is a control pipe and requires an ACK
        UEIE = 0xFF;            // enable all error interrupts
        _USBDeviceState = USBDeviceStateInitialized;
        _USBDeviceStatus = 0x01;   // self powered, remote wakeup disabled
#ifdef SHOW_ENUM_STATUS
        LATC &= 0xE0;
        LATCbits.LATC1 = 1;     // set bit 1 of LATC to indicate Powered state
#endif
    } else if (UIRbits.TRNIF) {
        currentBufferDescriptor = (USBBufferDescriptor *)((unsigned char *)(&_USBBD0O)+(USTAT&0x7C));  // mask out bits 0, 1, and 7 of USTAT for offset into the buffer descriptor table
        gCurrentBufferDescriptor.status = currentBufferDescriptor->status;
        gCurrentBufferDescriptor.count = currentBufferDescriptor->count;
        gCurrentBufferDescriptor.address = currentBufferDescriptor->address;
        gCachedUSTAT = USTAT;      // save the USB status register
        UIRbits.TRNIF = 0;      // clear TRNIF interrupt flag
#ifdef SHOW_ENUM_STATUS
        switch (gCachedUSTAT&0x18) {   // toggle bit 5, 6, or 7 of LATC to reflect EP0, EP1, or EP2 activity
            case EP0:
                LATC ^= 0x20;
                break;
            case EP1:
                LATC ^= 0x40;
                break;
            case EP2:
                LATC ^= 0x80;
        }
#endif
        _USBProcessEP0();
    }
}

void Setup()
{
    _USBSetup();
}

void main(void) {
    InitUSB();          // initialize the USB registers and serial interface engine
    while (1) {
        ServiceUSB();
    }
}
